# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.18-s082_1 on Wed Apr 17 10:48:03 EDT 2024

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1fF
set_units -time 1ps

# Set the current design
current_design riscv_stub

create_clock -name "clk" -period 1000.0 -waveform {0.0 500.0} [get_ports clk]
set_load -pin_load 50.0 [get_ports {instr_addr[31]}]
set_load -pin_load 50.0 [get_ports {instr_addr[30]}]
set_load -pin_load 50.0 [get_ports {instr_addr[29]}]
set_load -pin_load 50.0 [get_ports {instr_addr[28]}]
set_load -pin_load 50.0 [get_ports {instr_addr[27]}]
set_load -pin_load 50.0 [get_ports {instr_addr[26]}]
set_load -pin_load 50.0 [get_ports {instr_addr[25]}]
set_load -pin_load 50.0 [get_ports {instr_addr[24]}]
set_load -pin_load 50.0 [get_ports {instr_addr[23]}]
set_load -pin_load 50.0 [get_ports {instr_addr[22]}]
set_load -pin_load 50.0 [get_ports {instr_addr[21]}]
set_load -pin_load 50.0 [get_ports {instr_addr[20]}]
set_load -pin_load 50.0 [get_ports {instr_addr[19]}]
set_load -pin_load 50.0 [get_ports {instr_addr[18]}]
set_load -pin_load 50.0 [get_ports {instr_addr[17]}]
set_load -pin_load 50.0 [get_ports {instr_addr[16]}]
set_load -pin_load 50.0 [get_ports {instr_addr[15]}]
set_load -pin_load 50.0 [get_ports {instr_addr[14]}]
set_load -pin_load 50.0 [get_ports {instr_addr[13]}]
set_load -pin_load 50.0 [get_ports {instr_addr[12]}]
set_load -pin_load 50.0 [get_ports {instr_addr[11]}]
set_load -pin_load 50.0 [get_ports {instr_addr[10]}]
set_load -pin_load 50.0 [get_ports {instr_addr[9]}]
set_load -pin_load 50.0 [get_ports {instr_addr[8]}]
set_load -pin_load 50.0 [get_ports {instr_addr[7]}]
set_load -pin_load 50.0 [get_ports {instr_addr[6]}]
set_load -pin_load 50.0 [get_ports {instr_addr[5]}]
set_load -pin_load 50.0 [get_ports {instr_addr[4]}]
set_load -pin_load 50.0 [get_ports {instr_addr[3]}]
set_load -pin_load 50.0 [get_ports {instr_addr[2]}]
set_load -pin_load 50.0 [get_ports {instr_addr[1]}]
set_load -pin_load 50.0 [get_ports {instr_addr[0]}]
set_load -pin_load 50.0 [get_ports {data_addr[31]}]
set_load -pin_load 50.0 [get_ports {data_addr[30]}]
set_load -pin_load 50.0 [get_ports {data_addr[29]}]
set_load -pin_load 50.0 [get_ports {data_addr[28]}]
set_load -pin_load 50.0 [get_ports {data_addr[27]}]
set_load -pin_load 50.0 [get_ports {data_addr[26]}]
set_load -pin_load 50.0 [get_ports {data_addr[25]}]
set_load -pin_load 50.0 [get_ports {data_addr[24]}]
set_load -pin_load 50.0 [get_ports {data_addr[23]}]
set_load -pin_load 50.0 [get_ports {data_addr[22]}]
set_load -pin_load 50.0 [get_ports {data_addr[21]}]
set_load -pin_load 50.0 [get_ports {data_addr[20]}]
set_load -pin_load 50.0 [get_ports {data_addr[19]}]
set_load -pin_load 50.0 [get_ports {data_addr[18]}]
set_load -pin_load 50.0 [get_ports {data_addr[17]}]
set_load -pin_load 50.0 [get_ports {data_addr[16]}]
set_load -pin_load 50.0 [get_ports {data_addr[15]}]
set_load -pin_load 50.0 [get_ports {data_addr[14]}]
set_load -pin_load 50.0 [get_ports {data_addr[13]}]
set_load -pin_load 50.0 [get_ports {data_addr[12]}]
set_load -pin_load 50.0 [get_ports {data_addr[11]}]
set_load -pin_load 50.0 [get_ports {data_addr[10]}]
set_load -pin_load 50.0 [get_ports {data_addr[9]}]
set_load -pin_load 50.0 [get_ports {data_addr[8]}]
set_load -pin_load 50.0 [get_ports {data_addr[7]}]
set_load -pin_load 50.0 [get_ports {data_addr[6]}]
set_load -pin_load 50.0 [get_ports {data_addr[5]}]
set_load -pin_load 50.0 [get_ports {data_addr[4]}]
set_load -pin_load 50.0 [get_ports {data_addr[3]}]
set_load -pin_load 50.0 [get_ports {data_addr[2]}]
set_load -pin_load 50.0 [get_ports {data_addr[1]}]
set_load -pin_load 50.0 [get_ports {data_addr[0]}]
set_load -pin_load 50.0 [get_ports {data_wdata[31]}]
set_load -pin_load 50.0 [get_ports {data_wdata[30]}]
set_load -pin_load 50.0 [get_ports {data_wdata[29]}]
set_load -pin_load 50.0 [get_ports {data_wdata[28]}]
set_load -pin_load 50.0 [get_ports {data_wdata[27]}]
set_load -pin_load 50.0 [get_ports {data_wdata[26]}]
set_load -pin_load 50.0 [get_ports {data_wdata[25]}]
set_load -pin_load 50.0 [get_ports {data_wdata[24]}]
set_load -pin_load 50.0 [get_ports {data_wdata[23]}]
set_load -pin_load 50.0 [get_ports {data_wdata[22]}]
set_load -pin_load 50.0 [get_ports {data_wdata[21]}]
set_load -pin_load 50.0 [get_ports {data_wdata[20]}]
set_load -pin_load 50.0 [get_ports {data_wdata[19]}]
set_load -pin_load 50.0 [get_ports {data_wdata[18]}]
set_load -pin_load 50.0 [get_ports {data_wdata[17]}]
set_load -pin_load 50.0 [get_ports {data_wdata[16]}]
set_load -pin_load 50.0 [get_ports {data_wdata[15]}]
set_load -pin_load 50.0 [get_ports {data_wdata[14]}]
set_load -pin_load 50.0 [get_ports {data_wdata[13]}]
set_load -pin_load 50.0 [get_ports {data_wdata[12]}]
set_load -pin_load 50.0 [get_ports {data_wdata[11]}]
set_load -pin_load 50.0 [get_ports {data_wdata[10]}]
set_load -pin_load 50.0 [get_ports {data_wdata[9]}]
set_load -pin_load 50.0 [get_ports {data_wdata[8]}]
set_load -pin_load 50.0 [get_ports {data_wdata[7]}]
set_load -pin_load 50.0 [get_ports {data_wdata[6]}]
set_load -pin_load 50.0 [get_ports {data_wdata[5]}]
set_load -pin_load 50.0 [get_ports {data_wdata[4]}]
set_load -pin_load 50.0 [get_ports {data_wdata[3]}]
set_load -pin_load 50.0 [get_ports {data_wdata[2]}]
set_load -pin_load 50.0 [get_ports {data_wdata[1]}]
set_load -pin_load 50.0 [get_ports {data_wdata[0]}]
set_load -pin_load 50.0 [get_ports data_we]
set_clock_gating_check -setup 0.0 
set_input_delay -add_delay 1000.0 [get_ports reset]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[31]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[30]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[29]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[28]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[27]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[26]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[25]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[24]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[23]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[22]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[21]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[20]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[19]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[18]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[17]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[16]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[15]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[14]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[13]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[12]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[11]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[10]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[9]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[8]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[7]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[6]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[5]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[4]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[3]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[2]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[1]}]
set_input_delay -add_delay 1000.0 [get_ports {instr_data[0]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[31]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[30]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[29]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[28]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[27]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[26]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[25]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[24]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[23]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[22]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[21]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[20]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[19]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[18]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[17]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[16]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[15]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[14]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[13]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[12]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[11]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[10]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[9]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[8]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[7]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[6]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[5]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[4]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[3]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[2]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[1]}]
set_input_delay -add_delay 1000.0 [get_ports {data_rdata[0]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[31]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[30]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[29]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[28]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[27]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[26]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[25]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[24]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[23]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[22]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[21]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[20]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[19]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[18]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[17]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[16]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[15]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[14]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[13]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[12]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[11]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[10]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[9]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[8]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[7]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[6]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[5]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[4]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[3]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[2]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[1]}]
set_output_delay -add_delay 1000.0 [get_ports {instr_addr[0]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[31]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[30]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[29]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[28]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[27]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[26]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[25]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[24]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[23]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[22]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[21]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[20]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[19]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[18]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[17]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[16]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[15]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[14]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[13]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[12]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[11]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[10]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[9]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[8]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[7]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[6]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[5]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[4]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[3]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[2]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[1]}]
set_output_delay -add_delay 1000.0 [get_ports {data_addr[0]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[31]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[30]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[29]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[28]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[27]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[26]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[25]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[24]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[23]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[22]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[21]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[20]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[19]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[18]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[17]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[16]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[15]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[14]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[13]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[12]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[11]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[10]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[9]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[8]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[7]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[6]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[5]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[4]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[3]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[2]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[1]}]
set_output_delay -add_delay 1000.0 [get_ports {data_wdata[0]}]
set_output_delay -add_delay 1000.0 [get_ports data_we]
set_max_transition 400.0 [get_ports clk]
set_max_transition 400.0 [get_ports reset]
set_max_transition 400.0 [get_ports {instr_data[31]}]
set_max_transition 400.0 [get_ports {instr_data[30]}]
set_max_transition 400.0 [get_ports {instr_data[29]}]
set_max_transition 400.0 [get_ports {instr_data[28]}]
set_max_transition 400.0 [get_ports {instr_data[27]}]
set_max_transition 400.0 [get_ports {instr_data[26]}]
set_max_transition 400.0 [get_ports {instr_data[25]}]
set_max_transition 400.0 [get_ports {instr_data[24]}]
set_max_transition 400.0 [get_ports {instr_data[23]}]
set_max_transition 400.0 [get_ports {instr_data[22]}]
set_max_transition 400.0 [get_ports {instr_data[21]}]
set_max_transition 400.0 [get_ports {instr_data[20]}]
set_max_transition 400.0 [get_ports {instr_data[19]}]
set_max_transition 400.0 [get_ports {instr_data[18]}]
set_max_transition 400.0 [get_ports {instr_data[17]}]
set_max_transition 400.0 [get_ports {instr_data[16]}]
set_max_transition 400.0 [get_ports {instr_data[15]}]
set_max_transition 400.0 [get_ports {instr_data[14]}]
set_max_transition 400.0 [get_ports {instr_data[13]}]
set_max_transition 400.0 [get_ports {instr_data[12]}]
set_max_transition 400.0 [get_ports {instr_data[11]}]
set_max_transition 400.0 [get_ports {instr_data[10]}]
set_max_transition 400.0 [get_ports {instr_data[9]}]
set_max_transition 400.0 [get_ports {instr_data[8]}]
set_max_transition 400.0 [get_ports {instr_data[7]}]
set_max_transition 400.0 [get_ports {instr_data[6]}]
set_max_transition 400.0 [get_ports {instr_data[5]}]
set_max_transition 400.0 [get_ports {instr_data[4]}]
set_max_transition 400.0 [get_ports {instr_data[3]}]
set_max_transition 400.0 [get_ports {instr_data[2]}]
set_max_transition 400.0 [get_ports {instr_data[1]}]
set_max_transition 400.0 [get_ports {instr_data[0]}]
set_max_transition 400.0 [get_ports {data_rdata[31]}]
set_max_transition 400.0 [get_ports {data_rdata[30]}]
set_max_transition 400.0 [get_ports {data_rdata[29]}]
set_max_transition 400.0 [get_ports {data_rdata[28]}]
set_max_transition 400.0 [get_ports {data_rdata[27]}]
set_max_transition 400.0 [get_ports {data_rdata[26]}]
set_max_transition 400.0 [get_ports {data_rdata[25]}]
set_max_transition 400.0 [get_ports {data_rdata[24]}]
set_max_transition 400.0 [get_ports {data_rdata[23]}]
set_max_transition 400.0 [get_ports {data_rdata[22]}]
set_max_transition 400.0 [get_ports {data_rdata[21]}]
set_max_transition 400.0 [get_ports {data_rdata[20]}]
set_max_transition 400.0 [get_ports {data_rdata[19]}]
set_max_transition 400.0 [get_ports {data_rdata[18]}]
set_max_transition 400.0 [get_ports {data_rdata[17]}]
set_max_transition 400.0 [get_ports {data_rdata[16]}]
set_max_transition 400.0 [get_ports {data_rdata[15]}]
set_max_transition 400.0 [get_ports {data_rdata[14]}]
set_max_transition 400.0 [get_ports {data_rdata[13]}]
set_max_transition 400.0 [get_ports {data_rdata[12]}]
set_max_transition 400.0 [get_ports {data_rdata[11]}]
set_max_transition 400.0 [get_ports {data_rdata[10]}]
set_max_transition 400.0 [get_ports {data_rdata[9]}]
set_max_transition 400.0 [get_ports {data_rdata[8]}]
set_max_transition 400.0 [get_ports {data_rdata[7]}]
set_max_transition 400.0 [get_ports {data_rdata[6]}]
set_max_transition 400.0 [get_ports {data_rdata[5]}]
set_max_transition 400.0 [get_ports {data_rdata[4]}]
set_max_transition 400.0 [get_ports {data_rdata[3]}]
set_max_transition 400.0 [get_ports {data_rdata[2]}]
set_max_transition 400.0 [get_ports {data_rdata[1]}]
set_max_transition 400.0 [get_ports {data_rdata[0]}]
set_max_transition 400.0 [get_ports {instr_addr[31]}]
set_max_transition 400.0 [get_ports {instr_addr[30]}]
set_max_transition 400.0 [get_ports {instr_addr[29]}]
set_max_transition 400.0 [get_ports {instr_addr[28]}]
set_max_transition 400.0 [get_ports {instr_addr[27]}]
set_max_transition 400.0 [get_ports {instr_addr[26]}]
set_max_transition 400.0 [get_ports {instr_addr[25]}]
set_max_transition 400.0 [get_ports {instr_addr[24]}]
set_max_transition 400.0 [get_ports {instr_addr[23]}]
set_max_transition 400.0 [get_ports {instr_addr[22]}]
set_max_transition 400.0 [get_ports {instr_addr[21]}]
set_max_transition 400.0 [get_ports {instr_addr[20]}]
set_max_transition 400.0 [get_ports {instr_addr[19]}]
set_max_transition 400.0 [get_ports {instr_addr[18]}]
set_max_transition 400.0 [get_ports {instr_addr[17]}]
set_max_transition 400.0 [get_ports {instr_addr[16]}]
set_max_transition 400.0 [get_ports {instr_addr[15]}]
set_max_transition 400.0 [get_ports {instr_addr[14]}]
set_max_transition 400.0 [get_ports {instr_addr[13]}]
set_max_transition 400.0 [get_ports {instr_addr[12]}]
set_max_transition 400.0 [get_ports {instr_addr[11]}]
set_max_transition 400.0 [get_ports {instr_addr[10]}]
set_max_transition 400.0 [get_ports {instr_addr[9]}]
set_max_transition 400.0 [get_ports {instr_addr[8]}]
set_max_transition 400.0 [get_ports {instr_addr[7]}]
set_max_transition 400.0 [get_ports {instr_addr[6]}]
set_max_transition 400.0 [get_ports {instr_addr[5]}]
set_max_transition 400.0 [get_ports {instr_addr[4]}]
set_max_transition 400.0 [get_ports {instr_addr[3]}]
set_max_transition 400.0 [get_ports {instr_addr[2]}]
set_max_transition 400.0 [get_ports {instr_addr[1]}]
set_max_transition 400.0 [get_ports {instr_addr[0]}]
set_max_transition 400.0 [get_ports {data_addr[31]}]
set_max_transition 400.0 [get_ports {data_addr[30]}]
set_max_transition 400.0 [get_ports {data_addr[29]}]
set_max_transition 400.0 [get_ports {data_addr[28]}]
set_max_transition 400.0 [get_ports {data_addr[27]}]
set_max_transition 400.0 [get_ports {data_addr[26]}]
set_max_transition 400.0 [get_ports {data_addr[25]}]
set_max_transition 400.0 [get_ports {data_addr[24]}]
set_max_transition 400.0 [get_ports {data_addr[23]}]
set_max_transition 400.0 [get_ports {data_addr[22]}]
set_max_transition 400.0 [get_ports {data_addr[21]}]
set_max_transition 400.0 [get_ports {data_addr[20]}]
set_max_transition 400.0 [get_ports {data_addr[19]}]
set_max_transition 400.0 [get_ports {data_addr[18]}]
set_max_transition 400.0 [get_ports {data_addr[17]}]
set_max_transition 400.0 [get_ports {data_addr[16]}]
set_max_transition 400.0 [get_ports {data_addr[15]}]
set_max_transition 400.0 [get_ports {data_addr[14]}]
set_max_transition 400.0 [get_ports {data_addr[13]}]
set_max_transition 400.0 [get_ports {data_addr[12]}]
set_max_transition 400.0 [get_ports {data_addr[11]}]
set_max_transition 400.0 [get_ports {data_addr[10]}]
set_max_transition 400.0 [get_ports {data_addr[9]}]
set_max_transition 400.0 [get_ports {data_addr[8]}]
set_max_transition 400.0 [get_ports {data_addr[7]}]
set_max_transition 400.0 [get_ports {data_addr[6]}]
set_max_transition 400.0 [get_ports {data_addr[5]}]
set_max_transition 400.0 [get_ports {data_addr[4]}]
set_max_transition 400.0 [get_ports {data_addr[3]}]
set_max_transition 400.0 [get_ports {data_addr[2]}]
set_max_transition 400.0 [get_ports {data_addr[1]}]
set_max_transition 400.0 [get_ports {data_addr[0]}]
set_max_transition 400.0 [get_ports {data_wdata[31]}]
set_max_transition 400.0 [get_ports {data_wdata[30]}]
set_max_transition 400.0 [get_ports {data_wdata[29]}]
set_max_transition 400.0 [get_ports {data_wdata[28]}]
set_max_transition 400.0 [get_ports {data_wdata[27]}]
set_max_transition 400.0 [get_ports {data_wdata[26]}]
set_max_transition 400.0 [get_ports {data_wdata[25]}]
set_max_transition 400.0 [get_ports {data_wdata[24]}]
set_max_transition 400.0 [get_ports {data_wdata[23]}]
set_max_transition 400.0 [get_ports {data_wdata[22]}]
set_max_transition 400.0 [get_ports {data_wdata[21]}]
set_max_transition 400.0 [get_ports {data_wdata[20]}]
set_max_transition 400.0 [get_ports {data_wdata[19]}]
set_max_transition 400.0 [get_ports {data_wdata[18]}]
set_max_transition 400.0 [get_ports {data_wdata[17]}]
set_max_transition 400.0 [get_ports {data_wdata[16]}]
set_max_transition 400.0 [get_ports {data_wdata[15]}]
set_max_transition 400.0 [get_ports {data_wdata[14]}]
set_max_transition 400.0 [get_ports {data_wdata[13]}]
set_max_transition 400.0 [get_ports {data_wdata[12]}]
set_max_transition 400.0 [get_ports {data_wdata[11]}]
set_max_transition 400.0 [get_ports {data_wdata[10]}]
set_max_transition 400.0 [get_ports {data_wdata[9]}]
set_max_transition 400.0 [get_ports {data_wdata[8]}]
set_max_transition 400.0 [get_ports {data_wdata[7]}]
set_max_transition 400.0 [get_ports {data_wdata[6]}]
set_max_transition 400.0 [get_ports {data_wdata[5]}]
set_max_transition 400.0 [get_ports {data_wdata[4]}]
set_max_transition 400.0 [get_ports {data_wdata[3]}]
set_max_transition 400.0 [get_ports {data_wdata[2]}]
set_max_transition 400.0 [get_ports {data_wdata[1]}]
set_max_transition 400.0 [get_ports {data_wdata[0]}]
set_max_transition 400.0 [get_ports data_we]
set_input_transition 1000.0 [get_ports clk]
set_input_transition 1000.0 [get_ports reset]
set_input_transition 1000.0 [get_ports {instr_data[31]}]
set_input_transition 1000.0 [get_ports {instr_data[30]}]
set_input_transition 1000.0 [get_ports {instr_data[29]}]
set_input_transition 1000.0 [get_ports {instr_data[28]}]
set_input_transition 1000.0 [get_ports {instr_data[27]}]
set_input_transition 1000.0 [get_ports {instr_data[26]}]
set_input_transition 1000.0 [get_ports {instr_data[25]}]
set_input_transition 1000.0 [get_ports {instr_data[24]}]
set_input_transition 1000.0 [get_ports {instr_data[23]}]
set_input_transition 1000.0 [get_ports {instr_data[22]}]
set_input_transition 1000.0 [get_ports {instr_data[21]}]
set_input_transition 1000.0 [get_ports {instr_data[20]}]
set_input_transition 1000.0 [get_ports {instr_data[19]}]
set_input_transition 1000.0 [get_ports {instr_data[18]}]
set_input_transition 1000.0 [get_ports {instr_data[17]}]
set_input_transition 1000.0 [get_ports {instr_data[16]}]
set_input_transition 1000.0 [get_ports {instr_data[15]}]
set_input_transition 1000.0 [get_ports {instr_data[14]}]
set_input_transition 1000.0 [get_ports {instr_data[13]}]
set_input_transition 1000.0 [get_ports {instr_data[12]}]
set_input_transition 1000.0 [get_ports {instr_data[11]}]
set_input_transition 1000.0 [get_ports {instr_data[10]}]
set_input_transition 1000.0 [get_ports {instr_data[9]}]
set_input_transition 1000.0 [get_ports {instr_data[8]}]
set_input_transition 1000.0 [get_ports {instr_data[7]}]
set_input_transition 1000.0 [get_ports {instr_data[6]}]
set_input_transition 1000.0 [get_ports {instr_data[5]}]
set_input_transition 1000.0 [get_ports {instr_data[4]}]
set_input_transition 1000.0 [get_ports {instr_data[3]}]
set_input_transition 1000.0 [get_ports {instr_data[2]}]
set_input_transition 1000.0 [get_ports {instr_data[1]}]
set_input_transition 1000.0 [get_ports {instr_data[0]}]
set_input_transition 1000.0 [get_ports {data_rdata[31]}]
set_input_transition 1000.0 [get_ports {data_rdata[30]}]
set_input_transition 1000.0 [get_ports {data_rdata[29]}]
set_input_transition 1000.0 [get_ports {data_rdata[28]}]
set_input_transition 1000.0 [get_ports {data_rdata[27]}]
set_input_transition 1000.0 [get_ports {data_rdata[26]}]
set_input_transition 1000.0 [get_ports {data_rdata[25]}]
set_input_transition 1000.0 [get_ports {data_rdata[24]}]
set_input_transition 1000.0 [get_ports {data_rdata[23]}]
set_input_transition 1000.0 [get_ports {data_rdata[22]}]
set_input_transition 1000.0 [get_ports {data_rdata[21]}]
set_input_transition 1000.0 [get_ports {data_rdata[20]}]
set_input_transition 1000.0 [get_ports {data_rdata[19]}]
set_input_transition 1000.0 [get_ports {data_rdata[18]}]
set_input_transition 1000.0 [get_ports {data_rdata[17]}]
set_input_transition 1000.0 [get_ports {data_rdata[16]}]
set_input_transition 1000.0 [get_ports {data_rdata[15]}]
set_input_transition 1000.0 [get_ports {data_rdata[14]}]
set_input_transition 1000.0 [get_ports {data_rdata[13]}]
set_input_transition 1000.0 [get_ports {data_rdata[12]}]
set_input_transition 1000.0 [get_ports {data_rdata[11]}]
set_input_transition 1000.0 [get_ports {data_rdata[10]}]
set_input_transition 1000.0 [get_ports {data_rdata[9]}]
set_input_transition 1000.0 [get_ports {data_rdata[8]}]
set_input_transition 1000.0 [get_ports {data_rdata[7]}]
set_input_transition 1000.0 [get_ports {data_rdata[6]}]
set_input_transition 1000.0 [get_ports {data_rdata[5]}]
set_input_transition 1000.0 [get_ports {data_rdata[4]}]
set_input_transition 1000.0 [get_ports {data_rdata[3]}]
set_input_transition 1000.0 [get_ports {data_rdata[2]}]
set_input_transition 1000.0 [get_ports {data_rdata[1]}]
set_input_transition 1000.0 [get_ports {data_rdata[0]}]
set_wire_load_mode "enclosed"
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilao5hn1n02x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilao5hn1n04x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilao5hn1n06x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilao5hn1n08x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilao5hn1n12x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilao5hn1n16x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilb05hn1n02x3]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilb05hn1n02x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilb05hn1n03x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilb05hn1n04x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilb05hn1n06x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilb05hn1n08x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilb05hn1n12x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilb05hn1n16x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilb05hn1n24x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilb05hn1n32x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilb05hn1n48x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilb05hn1n64x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilb05hn1n80x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilb85hn1n02x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilb85hn1n03x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilb85hn1n04x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilb85hn1n08x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilb85hn1n12x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilb85hn1n16x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilb85hn1n24x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilb85hn1n32x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcilb85hn1n64x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcdiar2hn1n04x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcdiar2hn1n08x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcdiyr2hn1n04x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_seq_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcdiyr2hn1n08x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcand02an1n02x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcand02an1n03x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcand02an1n04x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcand02an1n08x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcand02an1n12x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcand02an1n16x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcand02an1n24x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcand02an1n32x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcand02an1n64x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcbf000an1n02x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcbf000an1n03x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcbf000an1n04x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcbf000an1n06x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcbf000an1n08x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcbf000an1n12x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcbf000an1n16x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcbf000an1n24x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcbf000an1n32x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcbf000an1n48x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcbf000an1n64x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcbf000an1n80x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcbf034an1n02x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcbf034an1n03x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcbf034an1n04x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcbf034an1n08x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcbf034an1n12x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcbf034an1n16x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcbf034an1n24x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcbf034an1n32x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcbf034an1n64x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcinv00an1n02x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcinv00an1n03x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcinv00an1n04x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcinv00an1n06x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcinv00an1n08x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcinv00an1n12x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcinv00an1n16x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcinv00an1n20x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcinv00an1n24x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcinv00an1n28x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcinv00an1n32x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcinv00an1n40x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcinv00an1n48x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcinv00an1n56x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcinv00an1n64x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcinv00an1n80x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mclb0a2an1n02x3]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mclb0a2an1n02x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mclb0a2an1n03x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mclb0a2an1n04x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mclb0a2an1n06x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mclb0a2an1n08x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mclb0a2an1n12x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mclb0a2an1n16x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mclb0a2an1n24x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mclb0a2an1n32x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mclb0a2an1n48x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mclb0a2an1n64x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mclb0a2an1n80x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mclb0o2an1n02x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mclb0o2an1n03x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mclb0o2an1n04x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mclb0o2an1n08x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mclb0o2an1n12x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mclb0o2an1n16x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mclb0o2an1n24x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mclb0o2an1n32x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mclb0o2an1n64x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcmbn22an1n02x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcmbn22an1n03x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcmbn22an1n04x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcmbn22an1n08x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcmbn22an1n12x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcmbn22an1n16x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcmbn22an1n24x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcmbn22an1n32x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcmbn22an1n64x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcorn02an1n02x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcorn02an1n03x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcorn02an1n04x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcorn02an1n08x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcorn02an1n12x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcorn02an1n16x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcorn02an1n24x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcorn02an1n32x5]
set_dont_use true [get_lib_cells lib224_b0m_6t_108pp_base_nom_tttt_1p000v_25c_tttt_ctyp_nldm/b0mcorn02an1n64x5]
set_clock_uncertainty -setup 50.0 [get_clocks clk]
set_clock_uncertainty -hold 50.0 [get_clocks clk]
